Управление_закупками/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <basedOn>Document.СчетКонтрагента</basedOn>
  <registerRecords>AccumulationRegister.ОстатокТовараПоСчету</registerRecords>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладах</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкаНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТоварнойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТоварнойНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.СчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокВнутреннихЗаказов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрытыеПотребности</name>
    <attributes>
      <name>ВнутреннийЗаказ</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПотребности</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗакрытоеПотребности</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПоставщика</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗакрытоеПоНакладной</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентЕдиницыИзмерения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПересчетаЕдиницИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСверхобъем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/Documents/ПриходнаяНакладная/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт

КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт 
	
	Товары = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений  
	
	УдалитьЛишниеСимволыВЗагружаемыхДанных(ЗагружаемыеДанные);
		
	ТЗНоменклатура = ЗагружаемыеДанные.Скопировать();
	ТЗНоменклатура.Свернуть("НоменклатураПоставщика"); 
		
	ТЗЕдиницыИзмерения = ЗагружаемыеДанные.Скопировать();
	ТЗЕдиницыИзмерения.Свернуть("ЕдиницаИзмерения"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Номенклатура.Ссылка) КАК СсылкаНоменклатуры
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ПолноеНаименование В(&ТЗНоменклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.ПолноеНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(КлассификаторЕдиницИзмерений.Ссылка) КАК СсылкаЕдиницыИзмерения
	|ПОМЕСТИТЬ ВТЕдиницыИзмерения
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерений КАК КлассификаторЕдиницИзмерений
	|ГДЕ
	|	КлассификаторЕдиницИзмерений.Наименование В(&ТЗЕдиницыИзмерения)
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификаторЕдиницИзмерений.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗМатериалы.Идентификатор КАК Идентификатор,
	|	ВЫРАЗИТЬ(ТЗМатериалы.НоменклатураПоставщика КАК СТРОКА(440)) КАК НоменклатураПоставщика,
	|	ВЫРАЗИТЬ(ТЗМатериалы.Количество КАК СТРОКА(20)) КАК Количество,
	|	ВЫРАЗИТЬ(ТЗМатериалы.ЕдиницаИзмерения КАК СТРОКА(10)) КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(ТЗМатериалы.Цена КАК СТРОКА(20)) КАК Цена
	|ПОМЕСТИТЬ ВТМатериалы
	|ИЗ
	|	&ТЗМатериалы КАК ТЗМатериалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМатериалы.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(ВТНоменклатура.СсылкаНоменклатуры, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ВТЕдиницыИзмерения.СсылкаЕдиницыИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерений.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ВТМатериалы.Количество КАК Количество,
	|	ВТМатериалы.Цена КАК Цена,
	|	ВТМатериалы.НоменклатураПоставщика КАК НоменклатураПоставщика
	|ИЗ
	|	ВТМатериалы КАК ВТМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО ВТМатериалы.НоменклатураПоставщика = ВТНоменклатура.СсылкаНоменклатуры.ПолноеНаименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЕдиницыИзмерения КАК ВТЕдиницыИзмерения
	|		ПО ВТМатериалы.ЕдиницаИзмерения = ВТЕдиницыИзмерения.СсылкаЕдиницыИзмерения.Наименование";
	
	Запрос.УстановитьПараметр("ТЗМатериалы", ЗагружаемыеДанные);
	Запрос.УстановитьПараметр("ТЗЕдиницыИзмерения", ТЗЕдиницыИзмерения);
	Запрос.УстановитьПараметр("ТЗНоменклатура", ТЗНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗРезультат = РезультатЗапроса.Выбрать(); 
	
	Пока ТЗРезультат.Следующий() Цикл
		
		СтрокаТовары = Товары.Добавить();   
		СтрокаТовары.Идентификатор = ТЗРезультат.Идентификатор;
		
		Если  ЗначениеЗаполнено(ТЗРезультат.ЕдиницаИзмерения) Тогда 
			
			СтрокаТовары.ЕдиницаИзмерения =   ТЗРезультат.ЕдиницаИзмерения;   
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТЗРезультат.Номенклатура) Тогда
			
			// Создать номенклатуру в справочнике
			ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементСправочника.ПолноеНаименование = ТЗРезультат.НоменклатураПоставщика;
			ЭлементСправочника.Записать(); 
			СтрокаТовары.НоменклатураПоставщика = ЭлементСправочника.Ссылка;
			
		Иначе
			
			СтрокаТовары.НоменклатураПоставщика =  ТЗРезультат.Номенклатура;
			
		КонецЕсли;
			
		СтрокаТовары.Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТЗРезультат.Цена);
		СтрокаТовары.Количество = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТЗРезультат.Количество);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Товары, АдресТаблицыСопоставления);

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

  Процедура УдалитьЛишниеСимволыВЗагружаемыхДанных(ЗагружаемыеДанные)
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		СтроковыеФункцииКлиентСервер.УдалитьЛишниеСимволы(СтрокаТаблицы.НоменклатураПоставщика); 
				
		СтроковыеФункцииКлиентСервер.УдалитьЛишниеСимволы(СтрокаТаблицы.ЕдиницаИзмерения);	
		СтрокаТаблицы.ЕдиницаИзмерения = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(СтрокаТаблицы.ЕдиницаИзмерения,".","Справа");
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
